sterentev/atdf-device-asm-include/inc/ATmega324PB.inc
; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	USART MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register UCSR0A bits		------------------------
.equ	RXC		= 7		; 0x80 - USART Receive Complete
.equ	TXC		= 6		; 0x40 - USART Transmit Complete
.equ	UDRE		= 5		; 0x20 - USART Data Register Empty
.equ	FE		= 4		; 0x10 - Framing Error
.equ	DOR		= 3		; 0x08 - Data Overrun
.equ	UPE		= 2		; 0x04 - Parity Error
.equ	U2X		= 1		; 0x02 - Double the USART transmission speed
.equ	MPCM		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR0B bits		------------------------
.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
.equ	UDRIE		= 5		; 0x20 - USART Data register Empty Interrupt Enable
.equ	RXEN		= 4		; 0x10 - Receiver Enable
.equ	TXEN		= 3		; 0x08 - Transmitter Enable
.equ	UCSZ2		= 2		; 0x04 - Character Size
.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR0C bits		------------------------
.equ	UMSEL_MASK	= 0xC0		;      - USART Mode Select (2 bits)
.equ	UMSEL0		= 6		;          UMSEL BIT0 position
.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
.equ	UPM0		= 4		;          UPM BIT0 position
.equ	USBS		= 3		; 0x08 - Stop Bit Select
.equ	UCSZ_MASK	= 0x06		;      - Character Size (2 bits)
.equ	UCSZ0		= 1		;          UCSZ BIT0 position
.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
;			0xC0		; Master SPI
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR0D bits		------------------------
.equ	RXSIE		= 7		; 0x80 - RX Start Frame Interrupt Enable
.equ	RXS		= 6		; 0x40 - Start Frame Detect Flag
.equ	SFDE		= 5		; 0x20 - Start Frame Detection Enable

; ----------	Register UCSR1A bits		------------------------
;.equ	RXC		= 7		; 0x80 - USART Receive Complete
;.equ	TXC		= 6		; 0x40 - USART Transmit Complete
;.equ	UDRE		= 5		; 0x20 - USART Data Register Empty
;.equ	FE		= 4		; 0x10 - Framing Error
;.equ	DOR		= 3		; 0x08 - Data Overrun
;.equ	UPE		= 2		; 0x04 - Parity Error
;.equ	U2X		= 1		; 0x02 - Double the USART transmission speed
;.equ	MPCM		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR1B bits		------------------------
;.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
;.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
;.equ	UDRIE		= 5		; 0x20 - USART Data register Empty Interrupt Enable
;.equ	RXEN		= 4		; 0x10 - Receiver Enable
;.equ	TXEN		= 3		; 0x08 - Transmitter Enable
;.equ	UCSZ2		= 2		; 0x04 - Character Size
;.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
;.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR1C bits		------------------------
;.equ	UMSEL_MASK	= 0xC0		;      - USART Mode Select (2 bits)
;.equ	UMSEL0		= 6		;          UMSEL BIT0 position
;.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
;.equ	UPM0		= 4		;          UPM BIT0 position
;.equ	USBS		= 3		; 0x08 - Stop Bit Select
;.equ	UCSZ_MASK	= 0x06		;      - Character Size (2 bits)
;.equ	UCSZ0		= 1		;          UCSZ BIT0 position
;.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
;			0xC0		; Master SPI
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR1D bits		------------------------
;.equ	RXSIE		= 7		; 0x80 - RX Start Frame Interrupt Enable
;.equ	RXS		= 6		; 0x40 - Start Frame Detect Flag
;.equ	SFDE		= 5		; 0x20 - Start Frame Detection Enable

; ----------	Register UCSR2A bits		------------------------
;.equ	RXC		= 7		; 0x80 - USART Receive Complete
;.equ	TXC		= 6		; 0x40 - USART Transmit Complete
;.equ	UDRE		= 5		; 0x20 - USART Data Register Empty
;.equ	FE		= 4		; 0x10 - Framing Error
;.equ	DOR		= 3		; 0x08 - Data Overrun
;.equ	UPE		= 2		; 0x04 - Parity Error
;.equ	U2X		= 1		; 0x02 - Double the USART transmission speed
;.equ	MPCM		= 0		; 0x01 - Multi-processor Communication Mode

; ----------	Register UCSR2B bits		------------------------
;.equ	RXCIE		= 7		; 0x80 - RX Complete Interrupt Enable
;.equ	TXCIE		= 6		; 0x40 - TX Complete Interrupt Enable
;.equ	UDRIE		= 5		; 0x20 - USART Data register Empty Interrupt Enable
;.equ	RXEN		= 4		; 0x10 - Receiver Enable
;.equ	TXEN		= 3		; 0x08 - Transmitter Enable
;.equ	UCSZ2		= 2		; 0x04 - Character Size
;.equ	RXB8		= 1		; 0x02 - Receive Data Bit 8
;.equ	TXB8		= 0		; 0x01 - Transmit Data Bit 8

; ----------	Register UCSR2C bits		------------------------
;.equ	UMSEL_MASK	= 0xC0		;      - USART Mode Select (2 bits)
;.equ	UMSEL0		= 6		;          UMSEL BIT0 position
;.equ	UPM_MASK	= 0x30		;      - Parity Mode Bits (2 bits)
;.equ	UPM0		= 4		;          UPM BIT0 position
;.equ	USBS		= 3		; 0x08 - Stop Bit Select
;.equ	UCSZ_MASK	= 0x06		;      - Character Size (2 bits)
;.equ	UCSZ0		= 1		;          UCSZ BIT0 position
;.equ	UCPOL		= 0		; 0x01 - Clock Polarity
; ::::  UMSEL	:::: bitfield values
;			0x00		; Asynchronous Operation
;			0x40		; Synchronous Operation
;			0xC0		; Master SPI
; ::::  UPM	:::: bitfield values
;			0x00		; Disabled
;			0x10		; Reserved
;			0x20		; Enabled, Even Parity
;			0x30		; Enabled, Odd Parity
; ::::  USBS	:::: bitfield values
;			0x00		; 1-bit
;			0x08		; 2-bit

; ----------	Register UCSR2D bits		------------------------
;.equ	RXSIE		= 7		; 0x80 - RX Start Frame Interrupt Enable
;.equ	RXS		= 6		; 0x40 - Start Frame Detect Flag
;.equ	SFDE		= 5		; 0x20 - Start Frame Detection Enable



; ====	TC8 MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register TCCR0B bits		------------------------
.equ	FOC0A		= 7		; 0x80 - Force Output Compare A
.equ	FOC0B		= 6		; 0x40 - Force Output Compare B
.equ	WGM02		= 3		; 0x08 - Waveform Generation Mode
.equ	CS0_MASK	= 0x07		;      - Clock Select (3 bits)
.equ	CS00		= 0		;          CS0 BIT0 position
; ::::  CS0	:::: bitfield values
;			0x00		; No Clock Source (Stopped)
;			0x01		; Running, No Prescaling
;			0x02		; Running, CLK/8
;			0x03		; Running, CLK/64
;			0x04		; Running, CLK/256
;			0x05		; Running, CLK/1024
;			0x06		; Running, ExtClk Tn Falling Edge
;			0x07		; Running, ExtClk Tn Rising Edge

; ----------	Register TCCR0A bits		------------------------
.equ	COM0A_MASK	= 0xC0		;      - Compare Match Output A Mode (2 bits)
.equ	COM0A0		= 6		;          COM0A BIT0 position
.equ	COM0B_MASK	= 0x30		;      - Compare Match Output B Mode (2 bits)
.equ	COM0B0		= 4		;          COM0B BIT0 position
.equ	WGM0_MASK	= 0x03		;      - Waveform Generation Mode (2 bits)
.equ	WGM00		= 0		;          WGM0 BIT0 position

; ----------	Register TIMSK0 bits		------------------------
.equ	OCIE0B		= 2		; 0x04 - Timer/Counter0 Output Compare Match B Interrupt Enable
.equ	OCIE0A		= 1		; 0x02 - Timer/Counter0 Output Compare Match A Interrupt Enable
.equ	TOIE0		= 0		; 0x01 - Timer/Counter0 Overflow Interrupt Enable

; ----------	Register TIFR0 bits		------------------------
.equ	OCF0B		= 2		; 0x04 - Timer/Counter0 Output Compare Flag 0B
.equ	OCF0A		= 1		; 0x02 - Timer/Counter0 Output Compare Flag 0A
.equ	TOV0		= 0		; 0x01 - Timer/Counter0 Overflow Flag

