sterentev/atdf-device-asm-include/inc/ATmega324PB.inc
; ----------	Register TWSR1 bits		------------------------
;.equ	TWS0_MASK	= 0xF8		;      - TWI Status (5 bits)
;.equ	TWS00		= 3		;          TWS0 BIT0 position
;.equ	TWPS_MASK	= 0x03		;      - TWI Prescaler (2 bits)
;.equ	TWPS0		= 0		;          TWPS BIT0 position
; ::::  TWPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 4
;			0x02		; 16
;			0x03		; 64

; ----------	Register TWAR1 bits		------------------------
;.equ	TWA_MASK	= 0xFE		;      - TWI (Slave) Address register Bits (7 bits)
;.equ	TWA0		= 1		;          TWA BIT0 position
;.equ	TWGCE		= 0		; 0x01 - TWI General Call Recognition Enable Bit



; ====	CFD MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register XFDCSR bits		------------------------
.equ	XFDIF		= 1		; 0x02 - Failure Detection Interrupt Flag
.equ	XFDIE		= 0		; 0x01 - Failure Detection Interrupt Enable



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
;.equ	JTD		= 7		; 0x80 - JTAG Interface Disable
.equ	BODS		= 6		; 0x40 - BOD Power Down in Sleep
.equ	BODSE		= 5		; 0x20 - BOD Power Down in Sleep Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

; ----------	Register MCUSR bits		------------------------
;.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag
.equ	WDRF		= 3		; 0x08 - Watchdog Reset Flag
.equ	BORF		= 2		; 0x04 - Brown-out Reset Flag
.equ	EXTRF		= 1		; 0x02 - External Reset Flag
.equ	PORF		= 0		; 0x01 - Power-on reset flag

; ----------	Register OSCCAL bits		------------------------
.equ	OSCCAL_MASK	= 0xFF		;      - Oscillator Calibration  (8 bits)
.equ	OSCCAL0		= 0		;          OSCCAL BIT0 position

; ----------	Register CLKPR bits		------------------------
.equ	CLKPCE		= 7		; 0x80 - 
.equ	CLKPS_MASK	= 0x0F		;      -  (4 bits)
.equ	CLKPS0		= 0		;          CLKPS BIT0 position
; ::::  CLKPS	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 4
;			0x03		; 8
;			0x04		; 16
;			0x05		; 32
;			0x06		; 64
;			0x07		; 128
;			0x08		; 256

; ----------	Register SMCR bits		------------------------
.equ	SM_MASK		= 0x0E		;      - Sleep Mode Select bits (3 bits)
.equ	SM0		= 1		;          SM BIT0 position
.equ	SE		= 0		; 0x01 - Sleep Enable
; ::::  SM	:::: bitfield values
;			0x00		; Idle
;			0x02		; ADC Noise Reduction (If Available)
;			0x04		; Power Down
;			0x06		; Power Save
;			0x08		; Reserved
;			0x0A		; Reserved
;			0x0C		; Standby
;			0x0E		; Extended Standby

; ----------	Register PRR0 bits		------------------------
.equ	PRTWI0		= 7		; 0x80 - Power Reduction TWI0
.equ	PRTIM2		= 6		; 0x40 - Power Reduction Timer/Counter2
.equ	PRTIM0		= 5		; 0x20 - Power Reduction Timer/Counter0
.equ	PRUSART1	= 4		; 0x10 - Power Reduction USART1
.equ	PRTIM1		= 3		; 0x08 - Power Reduction Timer/Counter1
.equ	PRSPI0		= 2		; 0x04 - Power Reduction Serial Peripheral Interface 0
.equ	PRUSART0	= 1		; 0x02 - Power Reduction USART0
.equ	PRADC		= 0		; 0x01 - Power Reduction ADC

; ----------	Register PRR1 bits		------------------------
.equ	PRTIM4		= 1		; 0x02 - Power Reduction Timer/Counter4
.equ	PRTIM3		= 0		; 0x01 - Power Reduction Timer/Counter3

; ----------	Register PRR2 bits		------------------------
.equ	PRPTC		= 3		; 0x08 - Power Reduction Peripheral Touch Controller
.equ	PRUSART2	= 2		; 0x04 - Power Reduction USART2
.equ	PRSPI1		= 1		; 0x02 - Power Reduction Serial Peripheral Interface 1
.equ	PRTWI1		= 0		; 0x01 - Power Reduction TWI1

; ----------	Register SPMCSR bits		------------------------
.equ	SPMIE		= 7		; 0x80 - SPM Interrupt Enable
.equ	RWWSB		= 6		; 0x40 - Read While Write Section Busy
.equ	SIGRD		= 5		; 0x20 - Signature Row Read
.equ	RWWSRE		= 4		; 0x10 - Read While Write section read enable
.equ	BLBSET		= 3		; 0x08 - Boot Lock Bit Set
.equ	PGWRT		= 2		; 0x04 - Page Write
.equ	PGERS		= 1		; 0x02 - Page Erase
.equ	SPMEN		= 0		; 0x01 - Store Program Memory Enable




; **********************************************************************
; ***************	EXTRA BITFIELDS VALUES	************************
; **********************************************************************
;
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64
; ::::  COMM_SCK_RATE_3BIT	:::: values
;			0b000		; fosc/4
;			0b001		; fosc/16
;			0b010		; fosc/64
;			0b011		; fosc/128
;			0b100		; fosc/2
;			0b101		; fosc/8
;			0b110		; fosc/32
;			0b111		; fosc/64



; **********************************************************************
; ***************	INTERRUPT VECTORS	************************
; **********************************************************************
;
.equ	INT_VECTORS_NUM		= 54
.equ	INT_VECTORS_SIZE	= 0x6C
;
; ----------	INTERRUPT INDEXES		------------------------
;
;	0	RESET		; External Pin,Power-on Reset,Brown-out Reset,Watchdog Reset,and JTAG AVR Reset. See Datasheet.     
;	1	INT0		; External Interrupt Request 0
;	2	INT1		; External Interrupt Request 1
;	3	INT2		; External Interrupt Request 2
;	4	PCINT0		; Pin Change Interrupt Request 0
;	5	PCINT1		; Pin Change Interrupt Request 1
;	6	PCINT2		; Pin Change Interrupt Request 2
;	7	PCINT3		; Pin Change Interrupt Request 3
;	8	WDT		; Watchdog Time-out Interrupt
;	9	TIMER2_COMPA	; Timer/Counter2 Compare Match A
;	10	TIMER2_COMPB	; Timer/Counter2 Compare Match B
;	11	TIMER2_OVF	; Timer/Counter2 Overflow
;	12	TIMER1_CAPT	; Timer/Counter1 Capture Event
;	13	TIMER1_COMPA	; Timer/Counter1 Compare Match A
;	14	TIMER1_COMPB	; Timer/Counter1 Compare Match B
;	15	TIMER1_OVF	; Timer/Counter1 Overflow
;	16	TIMER0_COMPA	; Timer/Counter0 Compare Match A
;	17	TIMER0_COMPB	; Timer/Counter0 Compare Match B
;	18	TIMER0_OVF	; Timer/Counter0 Overflow
;	19	SPI0_STC	; SPI0 Serial Transfer Complete
;	20	USART0_RX	; USART0 Rx Complete
;	21	USART0_UDRE	; USART0 Data register Empty
;	22	USART0_TX	; USART0 Tx Complete
;	23	ANALOG_COMP	; Analog Comparator
;	24	ADC		; ADC Conversion Complete
;	25	EE_READY	; EEPROM Ready
;	26	TWI0		; 2-wire Serial Interface 0
;	27	SPM_READY	; Store Program Memory Read
;	28	USART1_RX	; USART1 RX complete
;	29	USART1_UDRE	; USART1 Data Register Empty
;	30	USART1_TX	; USART1 TX complete
;	31	TIMER3_CAPT	; Timer/Counter3 Capture Event
;	32	TIMER3_COMPA	; Timer/Counter3 Compare Match A
;	33	TIMER3_COMPB	; Timer/Counter3 Compare Match B
;	34	TIMER3_OVF	; Timer/Counter3 Overflow
;	35	USART0_RXS	; USART0 RX start edge detect
;	35	USART0_START	; USART0 RX start edge detect
;	36	USART1_RXS	; USART1 RX start edge detect
;	36	USART1_START	; USART1 RX start edge detect
;	37	PCINT4		; Pin Change Interrupt Request 4
;	38	XOSCFD		; Crystal failure detect
;	39	PTC_EOC		; PTC end of conversion
;	40	PTC_WCOMP	; PTC window comparator interrupt
;	41	SPI1_STC	; SPI1 Serial Transfer Complete
;	42	TWI1		; 2-wire Serial Interface 1
;	43	TIMER4_CAPT	; Timer/Counter4 Capture Event
;	44	TIMER4_COMPA	; Timer/Counter4 Compare Match A
;	45	TIMER4_COMPB	; Timer/Counter4 Compare Match B
;	46	TIMER4_OVF	; Timer/Counter4 Overflow
;	47	USART2_RX	; USART2 Rx Complete
;	48	USART2_UDRE	; USART2 Data register Empty
;	49	USART2_TX	; USART2 Tx Complete
;	50	USART2_RXS	; USART2 RX start edge detect
;	50	USART2_START	; USART2 RX start edge detect



